[
    {
        "hlavnatema": "Úvodné stretnutie",
        "datum": "24.09.2025",
        "cas": "14:30-15:40",
        "inperson": true,
        "kratkypopis": "Úvodné zoznámenie a očakávania vedúceho pre projekt",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": false,
        "prejednavaneveci": "Oboznámenie sa s témov a jej očakávaniami",
        "zaver": "Stretli sme s s vedúcim a následne sme začali zoznamovanie. Každý člen tímu vrátane vedúceho porozprával v krátkosti o sebe a o tom čomu by sa chcel venovať. Následne nám bolo vysvetlené čomu náš projekt prispeje a prečo vlastne tento projekt bol vypísaný pre riešenie. Po pochopení sme sa presunuli k téme projektu a jeho dvom hlavným častiam. Prvou hlavnou časťou je vytvoriť objednávkový systém kde budú dve strany, teda buď poskytovateľ alebo klient. Poskytovateľ bude mať možnosť sa prihlásiť ako firma a následne vyplniť údaje o tom aké, kedy a ako poskytuje služby. Naproti tomu klient bude mať možnosť sa registrovať a následne objednať na tieto poskytované služby. Druhou hlavnou časťou, ktorá bola rozoberaná na stretnutí je prirodzený jazyk. Dospelo sa k záveru, že prirodzený jazyk bude budúcou formou komunikácie so strojmi, teda práve vďaka tomuto sa v druhej časti projektu budeme venovať prepojeniu našeho systému s umelou inteligenciou pre porozumenie prirodzenému jazyku. Teda používateľ zadá 'Objednaj ma k zubárovi 14:30 na štvrtok' a systém klienta rezervuje. Posledným bodom programu bola dohodnutá budúca komunikácia s vedúcim a tam sme sa dohodli na discorde a každotýždennom stretnutí."
    },
    {
        "hlavnatema": "Upresnenie požiadaviek",
        "datum": "29.09.2025",
        "cas": "17:00-18:35",
        "inperson": false,
        "kratkypopis": "Na stretnutí sme si upresnili požiadavky klienta (vedúceho) pre projekt.",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Oboznámenie sa s témov a jej očakávaniami",
        "zaver": "Stretli sme sa online cez aplikáciu discord kde sme zahájili stretnutie dotazmi na klienta, teda nášho vedúceho projektu aby sme vedeli čo musí vyvíjaná aplikácia obsahovať. Zároveň sme kategorizovali požiadavky na aplikáciu ako must-have a nice-to-have. Na stretnutí sme rozoberali potrebné role pre aplikáciu, use-case-y pre každú rolu a celé také gro aplikácie a jej hlavné body. Dospeli sme k záveru že role budú zarial klasifikované ako poskytovateľ, klient, administrátor a entita. Prejednávali sme či musí byť prihlásený v systéme aj poskytovateľ služby, teda napríklad kaderník Tomáš bude strihať a bude musieť mať aj vytvorené konto v aplikácii. Stanovisko bolo zaujaté práve tak, aby mal aj účet, značne to sprehľadní celý systém a zjednoduší budúce notifikácie. Načrtli sme aj gro práce a to teda samotné objednávanie a formy ktoré sú očakávané, teda že klient môže vyhľadávať podĽa kategórie služieb, ktoré sú ponúkané ale aj podľa ľudí, ktorý službu poskytujú. Tak isto budeme implementovať aj hodnotenie, filtráciu cien a toho, ako ďaleko sa služba nachádza. Viac o stretnutí doplníme neskôr..."
    },
    {
        "hlavnatema": "Spísanie požiadaviek",
        "datum": "02.10.2025",
        "cas": "18:00-20:45",
        "inperson": false,
        "kratkypopis": "Spísali sme si všetky požiadavky a rozdelili sme ich",
        "veduci": false,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Rozdelenie požiadaviek a use-casov",
        "zaver": "V jira sme si vytvorili page a v nej sme uviedli všetky požiadavky ktoré boli prekonzultované na predošlom stretnutí, následne boli požiadavky prerozdelené na funkcionálne, nefunkcionálne a doménové. Potom sme taktiež rozdelili jednotlivé use-casy na must-have a nice-to-have v našom dokumente. Vzniklo pár otázok, ktoré budú odkonzultované s vedúcim na najbližšom stretnutí."
    },
    {
        "hlavnatema": "Kontrola a doplnenie FR",
        "datum": "6.10.2025",
        "cas": "17:00-18:30",
        "inperson": false,
        "kratkypopis": "Veduci skontroloval zapracovanie Functional Requirements z minula + implementácia tabulky pre FR",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Zapracovanie FR do tabulky",
        "zaver": "Bola urobena tabulka z FR a nasledne sme ich ocislovali a dorozdelovali na must have a nice to have. Dalwj boli dopracovane tie kde vzbiky z minula otazky."
    },
    {
        "hlavnatema": "Doplnenie FR",
        "datum": "6.10.2025",
        "cas": "18:30-19:10",
        "inperson": false,
        "kratkypopis": "Clenovia timu hned po predoslom stretnuti s veducim spracovali dalsie FR...",
        "veduci": false,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Zapracovanie FR do tabulky",
        "zaver": "Po predoslom stretnuti s veducim, boli vypracovane vsetky odhalene nedostatky a nove FR."
    },
    {
        "hlavnatema": "Zadanie na týždeň",
        "datum": "13.10.2025",
        "cas": "17:00-17:20",
        "inperson": false,
        "kratkypopis": "Vedúci zadal úlohu - vypracovať use-case diagram",
        "veduci": false,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Úlohy na ďalší týždeň",
        "zaver": "Vedúci zadal úlohu - vypracovať use-case diagram, v nasledovnom týždni sa tím bude usilovne venovať vytvoreniu use case diagramu - prípadene aj use-case tabuľky (scenárov)"
    },
    {
        "hlavnatema": "Kontrola Use-case diagramu",
        "datum": "21.10.2025",
        "cas": "18:30-18:55",
        "inperson": false,
        "kratkypopis": "Počas minulého týždňa sme vypracovali Use-case diagram a na stretnutí s vedúcim sme ho prešli a skontrolovali.",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": false,
        "prejednavaneveci": "Vysvetlenie chýb a kontrola Use-case diagramu",
        "zaver": "Spomenieme iba chyby a veci, ktoré boli spomenuté a navrhnuté na prerobenie alebo drobnú úpravu... Pri účtoch rozlišujeme zmenu hesla a zabudnutie hesla v diagrame, provider musí menežovať rezervácie, granularizovať popis 'Rôzne spôsoby rezervácie' v UC diagrame, chýba zmazanie služby --iba v prípade, že neexistuje žiadna rezervácia na danú službu (historic data), pridali sme teda celé nové rozhranie 'Spravovanie služby'"
    },
    {
        "hlavnatema": "Zapracovanie zmien",
        "datum": "21.10.2025",
        "cas": "18:55-19:44",
        "inperson": false,
        "kratkypopis": "V stretnutí sme pokračovali rovno po kontrole UC diagramu a zapracovali sme všetky zmeny ktoré vedúci navrhol.",
        "veduci": false,
        "jakubd": true,
        "samueld": true,
        "nicolasd": false,
        "vratkob": true,
        "miroslavas": false,
        "prejednavaneveci": "Zapracovanie zmien do UC diagramu",
        "zaver": "Aktuálne by sme mali mať priravený UC diagram podľa požiadaviek vedúceho. V prípade, že by sme mali ešte nejaké otázky, môžeme ich prebrať na ďalšom stretnutí."
    },
    {
        "hlavnatema": "Kontrola Class Diagramu",
        "datum": "30.10.2025",
        "cas": "17:00-18:15",
        "inperson": false,
        "kratkypopis": "Stretnutie s vedúcim za účelom kontroly a pripomienok k vytvorenému Class Diagramu.",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Prezentácia a kontrola Class Diagramu s vedúcim, diskusia o potrebných úpravách a doplneniach.",
        "zaver": "Získali sme pripomienky k Class Diagramu, ktoré zapracujeme pred ďalším stretnutím."
    },
    {
        "hlavnatema": "Kontrola ER Diagramu",
        "datum": "10.10.2025",
        "cas": "17:00-17:30",
        "inperson": false,
        "kratkypopis": "Stretnutie s vedúcim za účelom kontroly a pripomienok k vytvorenému ER Diagramu.",
        "veduci": true,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Prezentácia a kontrola ER Diagramu s vedúcim, diskusia o potrebných úpravách a doplneniach.",
        "zaver": "Získali sme pripomienky k ER Diagramu, ktoré zapracujeme pred ďalším stretnutím. Zároveň vedúci podotkol, že v class diagrame sa nachádza pár drobností, ktoré je ešte potrebné opraviť."
    },
    {
        "hlavnatema": "Úprava ER a UC Diagramov",
        "datum": "23.11.2025",
        "cas": "17:30-21:05",
        "inperson": false,
        "kratkypopis": "Úprava diagramov a zapracovanie požiadaviek vedúceho.",
        "veduci": false,
        "jakubd": true,
        "samueld": true,
        "nicolasd": true,
        "vratkob": true,
        "miroslavas": true,
        "prejednavaneveci": "Úprava ER a UC Diagramov podľa požiadaviek vedúceho.",
        "zaver": "Diagramy boli upravené a pripravené na ďalšiu kontrolu."
    }
]
